import pytest
import numpy as np
from . import RESOURCES_PATH

from behsan_text_to_vec import TextToVec
from behsan_text_to_vec.utils import cosine_similarity

ttv = TextToVec()

text = "دایی با زدن ۱۰۹ گل در ۱۴۹ بازی ملی بهترین گلزن تاریخ تیم ملی فوتبال ایران و دومین گلزن برتر جهان در رده ملی، شناخته می‌شود. او در نظرسنجی سایت کنفدراسیون فوتبال آسیا و برنامهٔ تلویزیونی ۹۰ به ترتیب با کسب «۵۹ درصد» و «۷۳ درصد» آراء مخاطبان، به عنوان بهترین مهاجم تاریخ جام ملت‌های آسیا و بهترین مهاجم بعد از انقلاب ۱۳۵۷ در ایران انتخاب شد. دایی با ثبت ۱۴ گل، رکورد بیشترین گلزنی در تمام ادوار جام ملت‌های آسیا را در اختیار دارد."
text_sim = "علی دایی را همه می شناسند. او یکی از بهترین گلزنان تیم ملی فوتبال ایران و همچنین بهترین مهاجم تاریخ جام ملت های آسیاست. علی دایی سفیر یونیسف بوده است. این فوتبالیست ملی کشورمان در عرصه فوتبال در باشگاه‌های بسیاری مانند تاکسیرانی تهران، بانک تجارت، پرسپولیس، السد قطر، آرمینیا بیله فلد، بایرن مونیخ، هرتابرلین، الشباب امارات، صبا باتری، سایپا البرز و سرمربی چندین تیم ازجمله راه آهن، سایپا و پرسپولیس بوده است. در ادامه با جزئیات زندگی شخصی و ورزشی علی دایی آشنا می شوید."
text_unsim = "از دیدنی‌های این شهر می‌توان به اولین چاه نفتی در خاورمیانه، دامنه کوه آسماری، تفرجگاه تمبی، آتشکده سرمسجد و پرستشگاه برد نشانده که بزرگ‌ترین معبد روباز هخامنشی در ایران و جهان است، اشاره کرد. به واسطه‌ی ارتباط با جهان معاصر و ورود مدرنیته از طریق صنعت، از لحاظ هنر و ادبيات نیز مسجدسلیمان پایه های ادبیات داستانی سوسیالیست کارگری از طریق داستان های منوچهر شفیانی و سایر نویسندگان مسجدسلیمانی و همچنین در زمینه شعر نو سبک شعر ناب شاعرانی همچون هوشنگ چالنگی یارمحمد اسدپور هرمز علی پور آریا آریاپور در فرهنگ و هنر معاصر ایران تاثیر گذار بود."


def test_similarity():
    vec = ttv(text)
    vec_sim = ttv(text_sim)
    vec_unsim = ttv(text_unsim)
    assert cosine_similarity(vec, vec_sim) > cosine_similarity(vec, vec_unsim)


def test_type():
    vec = ttv(text)
    assert isinstance(vec, np.ndarray)